# أكتب برنامج مهمته رسم الشكل التالي بواسطة الحلقات.
# عند تشغيل البرنامج, يجب أن يطلب من المستخدم 
# إدخال عدد أسطر الشكل الذي سيتم رسمه.
# إنتبه: يجب أن يدخل المستخدم عدد مفرد و أكبر من صفر
# مع الإشارة إلى أنه في حال قام بإدخال عدد مزدوج يجب أن يتم قبوله مع إضافة واحد عليه حتى يصبح مفرد.

rows=int(input("enter num of rows"))
if rows%2 == 0:
    rows=rows+1
for i in range(rows):
    m=" "
    for y in range(rows):
        if i==y or y==rows-i-1:
            m=m+"*"
        else:
            m=m+" "
    print(m)