# gc__title
# https://www.aljazeera.net/where/arab/syria/
# استخراج عناوين الأخبار من موقع الجزيرة

import urllib.request
from bs4 import BeautifulSoup

page = urllib.request.urlopen('https://www.aljazeera.net/where/arab/syria/')
soup = BeautifulSoup(page, 'html.parser')
news = soup.findAll('h3', {'class': 'gc__title'})
for one in news:
    title = one.text.strip()
    link = one.find('a')['href']
    print(title, link)

path = r"C:\new\folder"
print(path)


# لجنة أممية تعتبر التدخل الإسرائيلي تهديدا للسلام الهش في سوريا
# قتيل وإصابات في غارات إسرائيلية جديدة على سوريا
# خلال لقائه الشرع.. جنبلاط يدعو للتحقيق بأحداث جرمانا ويرفض التدخل الدولي
# مؤتمر القامشلي.. ماذا بعد تراجع قسد عن تفاهماتها مع دمشق؟
# إمام الشيعة: سوريا لا تُحكَم إلا برئيس سُنّي وهذا ما فعله البعث
# الدويري: إسرائيل تسعى لتقسيم سوريا إلى 4 كانتونات
# بعد هدوء صحنايا.. ترتيبات أمنية خاصة بالسويداء
# "آسر".. هل تتفوق النسخة العربية على العمل الأصلي؟
# العقوبات الدولية أهم عقبة أمام إعادة تحديث ميناء اللاذقية
# أبرز رسائل إسرائيل إلى الشرع بضرب محيط القصر الرئاسي
# الرئاسة السورية: القصف الإسرائيلي قرب القصر الرئاسي تصعيد خطير
# كيف علّق أهالي الغاب بريف حماة على تصريحات رامي مخلوف؟
# إسرائيل تختبر تركيا: كيف تُدار معارك "الإحماء" في صراع الدول؟
# كاتس يحذر الشرع بعد قصف محيط القصر الرئاسي بدمشق